MarcoHG/MPC5744P_examples/FLASH_ECC_Error_Injection_MPC5744P/src/main.c
/*******************************************************************************
* NXP Semiconductors
* (c) Copyright 2016 NXP Semiconductors
* ALL RIGHTS RESERVED.
********************************************************************************
Services performed by NXP in this matter are performed AS IS and without any
warranty. CUSTOMER retains the final decision relative to the total design
and functionality of the end product. NXP neither guarantees nor will be held
liable by CUSTOMER for the success of this project.
NXP DISCLAIMS ALL WARRANTIES, EXPRESSED, IMPLIED OR STATUTORY INCLUDING,
BUT NOT LIMITED TO, IMPLIED WARRANTY OF MERCHANTABILITY OR FITNESS FOR
A PARTICULAR PURPOSE ON ANY HARDWARE, SOFTWARE ORE ADVISE SUPPLIED
TO THE PROJECT BY NXP, AND OR NAY PRODUCT RESULTING FROM NXP SERVICES.
IN NO EVENT SHALL NXP BE LIABLE FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING
OUT OF THIS AGREEMENT.
CUSTOMER agrees to hold NXP harmless against any and all claims demands
or actions by anyone on account of any damage, or injury, whether commercial,
contractual, or tortuous, rising directly or indirectly as a result
of the advise or assistance supplied CUSTOMER in connection with product,
services or goods supplied under this Agreement.
********************************************************************************
* File:             main.c
* Owner:            David Tosenovjan
* Version:          1.0
* Date:             Jul-17-2017
* Classification:   General Business Information
* Brief:			Shows ECC error, correctable and non-correctable
********************************************************************************
* Detailed Description:
* Purpose of the example is to show how to generate Multi-bit or Single-bit
* ECC error in internal FLASH (user must choose it in the option at the end of
* main function).
* Flash over-programming is used to generate a non-correctable (or single-bit)
* ECC error in FLASH. The bad data is accessed and then generates IVOR1
* exception or FCCU_Alarm_Interrupt. Both functions call MEMU handler.
* Example also offers useful macros for MEMU module.
* The example displays notices in the terminal window (connector J19 on
* MPC57xx_Motherboard or J12 on DEVKIT-MPC5744P)
* (19200-8-no parity-1 stop bit-no flow control on eSCI_A).
* No other external connection is required.
* ------------------------------------------------------------------------------
* Test HW:         DEVKIT-MPC5744P
* MCU:             SPC5744PFMLQ9,1N15P,WWAL1621Q
* Fsys:            200 MHz PLL with 40 MHz crystal reference
* Debugger:        OpenSDA
* Target:          internal_FLASH, RAM
* Terminal:        19200-8-no parity-1 stop bit-no flow control
* EVB connection:  none
********************************************************************************
Revision History:
Ver  Date         Author            Description of Changes
0.0  Mar-05-2016  David Tosenovjan  Initial version
1.0	 Jul-17-2017  David Chung		Updated for production EVB and S32DS for Power v1.2
*******************************************************************************/

#include "uart.h"
#include <stdio.h>
#include "MPC5744P.h"
#include <string.h>
#include "MPC5744P_MEMU_macros.h"
#include <string.h>


/*******************************************************************************
* External objects
*******************************************************************************/

/*******************************************************************************
* Global variables
*******************************************************************************/
//extern const uint32_t IntcIsrVectorTable[];
extern void xcptn_xmpl(void);
extern void ClearMCSR(void);
extern void Increment_MCSRR0_to_next_instruction(void);
extern void SetMSR_ME(void);


/*******************************************************************************
* Constants and macros
*******************************************************************************/
#define VLE_IS_ON 1

#define DRUN_MODE   0x3

/* FCCU keys */
#define FCCU_NCFK_KEY 0xAB3498FE

/* CTRLK register OP-keys for FCCU configuration */
#define KEY_OP1  0x913756AF
#define KEY_OP2  0x825A132B
#define KEY_OP16 0x7ACB32F0
#define KEY_OP31 0x29AF8752


/*******************************************************************************
* Local types
*******************************************************************************/

/*******************************************************************************
* Local function prototypes
*******************************************************************************/
void Sys_Init(void);
void FCCU_Init(void);
void ClearNCF(void);
void FCCU_Alarm_Interrupt(void);

void MEMU_handler(void);
void Machine_check_handler(void);

void Generate_noncorrectable_FLASH_ECC_error(void);
void Generate_1bit_FLASH_ECC_error(void);
void Fix_2bit_error_FLASH_data(void);
void Erase_L7_block(void);


/*******************************************************************************
* Global variables
*******************************************************************************/
uint32_t NCF_status[4];
uint32_t Hex_to_ASCII[] = {'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};

/* debugging variables */
vint32_t IVOR1_handler_pass_count = 0;
vint32_t noncritical_fault_count = 0;

/*******************************************************************************
* Local functions
*******************************************************************************/

/*******************************************************************************
Function Name : Sys_Init
Engineer      : Petr Vlna
Date          : Dec-19-2014
Parameters    :
Modifies      :
Returns       :
Notes         : Clock settings 200MHz PLL
Issues        :
*******************************************************************************/
void Sys_Init(void)
{
    //Clk Out
    MC_CGM.AC6_SC.R = 0x02000000;  //Enable PLL0 - clkout0 //MC_CGM_AC6_SC
    MC_CGM.AC6_DC0.B.DE = 1;       //Enable divider for SYSCLK0
    MC_CGM.AC6_DC0.B.DIV = 0;      //Set divider for SYSCLK0

    //Configure RunPeripheralConfiguration regist   ers in ME_RUN_PC0
    MC_ME.RUN_PC[0].B.DRUN = 1;    //Enable DRUN mode for all peripherals

    //Enable external oscilator
    MC_ME.DRUN_MC.B.XOSCON = 1;

