MarcoHG/MPC5744P_examples/FLASH_ECC_Error_Injection_MPC5744P/src/main.c
    //AUX Clock Selector 3 setup
    MC_CGM.AC3_SC.B.SELCTL =0x01;  //connect (8..40MHz) XTALL to the PLL0 input
    MC_ME.DRUN_MC.B.PLL0ON = 1;    //Enable PLL0 for DRUN mode

    // Set PLL0 to 200MHz
    PLLDIG.PLL0CR.B.CLKCFG = 1;             //Bypass mode PLL0 on
    // RFDPHI1 = 10, RFDPHI = 2, PREDIV = 2, MFD = 14
    PLLDIG.PLL0DV.R = 0x50000000 |0x00020000 |0x00002000 |0x0014 ;

    // Set PPL0 as system clock
    MC_ME.DRUN_MC.B.SYSCLK = 0x2;
    //  Enable system clock divider /4
    MC_CGM.SC_DC0.B.DIV = 0x3;

    //Mode transition to apply the PLL0 setup and set Normal mode with PLL
    MC_ME.MCTL.R = 0x30005AF0;      //DRUN Mode & Key
    MC_ME.MCTL.R = 0x3000A50F;      //DRUN Mode & Key

    while(!MC_ME.GS.B.S_PLL0);      //ME_GS Wait for PLL stabilization.
    while(MC_ME.GS.B.S_MTRANS);     //Waiting for end of transaction
    // ME_GS Check DRUN mode has successfully been entered
    while(MC_ME.GS.B.S_CURRENT_MODE != DRUN_MODE);
}


/*******************************************************************************
Function Name : FCCU_Init
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
Issues        :
*******************************************************************************/
void FCCU_Init(void)
{
    /* clear possible faults*/
    ClearNCF();

    /* Unlock configuration */
    FCCU.TRANS_LOCK.R = 0xBC;
    /* provide Config state key */
    FCCU.CTRLK.R = 0x913756AF; //key for OP1
    /* enter config state - OP1 */
    FCCU.CTRL.R = 0x1; //set OP1 - set up FCCU into the CONFIG mode
    /* wait for successful state transition */
    while (FCCU.CTRL.B.OPS != 0x3); //operation status succesful

    /* Non-critical fault enable for all MEMU sources */
    FCCU.NCF_TOE[0].R = 0xFFFFFFFF; //ALARM Timeout Enable
    FCCU.NCF_E[0].R = 0x00FF8000; // NCF[15]-NCF[23]
    FCCU.IRQ_ALARM_EN[0].R = 0x00FF8000;

    /* set up the NORMAL mode of FCCU */
    FCCU.CTRLK.R = 0x825A132B; //key for OP2
    FCCU.CTRL.R = 0x2; //set the OP2 - set up FCCU into the NORMAL mode
    while (FCCU.CTRL.B.OPS != 0x3); //operational status succesful
}


/*******************************************************************************
Function Name : ClearNCF
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         : clears all FCCU faults
Issues        :
*******************************************************************************/
void ClearNCF(void)
{
    volatile uint32_t i,b[4];
    for(i=0;i<4;i++)
    {
        FCCU.NCFK.R = FCCU_NCFK_KEY;
        FCCU.NCF_S[i].R = 0xFFFFFFFF;
        while(FCCU.CTRL.B.OPS != 0x3)
        {

        };              /* wait for the completion of the operation */
        b[i]=FCCU.NCF_S[i].R;
        if(b[i]){}
    }
}


/*******************************************************************************
Function Name : FCCU_Alarm_Interrupt
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
Issues        : for simplicity it clears all faults!
*******************************************************************************/
void FCCU_Alarm_Interrupt(void)
{
   uint32_t i;

   MEMU_handler();

   FCCU.CTRL.R = 10; /* OP10 - Read the NCF status registers */
   while(FCCU.CTRL.B.OPS != 0x3)
   {
   };      /* wait for the completion of the operation */

   /* load these regs to the variable field */
   for(i=0;i<4;i++)
   {
       NCF_status[i] = FCCU.NCF_S[i].R;
   }

   noncritical_fault_count++;
   ClearNCF();
}


/*******************************************************************************
Function Name : MEMU_handler
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
*******************************************************************************/
void MEMU_handler(void)
{
    uint32_t MEMU_ERR_FLAG_value = 0;
    uint32_t i;

    /* examine source of ECC error */
    /* for the purpose of this example only FLASH errors are being examined */

    MEMU_ERR_FLAG_value = MEMU.ERR_FLAG.R;

    if (MEMU_ERR_FLAG_value & MEMU_ERR_FLAG_FLASH_all)
    {
        //printf("FLASH ECC error found\r\n");
    	uint8_t message0[] = {"FLASH ECC error found\r\n"};
    	TransmitData((const char*)message0, strlen((const char*)message0));
        if (MEMU_ERR_FLAG_value & MEMU_ERR_FLAG_F_UCE)
        {
            if (1 == MEMU.FLASH_UNCERR_STS.B.VLD)
            {

            	/* printf("It is non-correctable error at address "); */
            	uint32_t data = MEMU.FLASH_UNCERR_ADDR.R; //Need to print the value of this register. But convert to ASCII first
            	uint8_t data_ASCII[9] = {0}; //ASCII array for converting data to ASCII, null terminated
            	uint8_t message0[] = {"It is non-correctable error at address "};
            	TransmitData((const char*)message0, strlen((const char*)message0));

                /* printf("0x%08X\r\n",MEMU.FLASH_UNCERR_ADDR.R); */

            	uint8_t message1_0[] = {"0x"};
            	TransmitData((const char*)message1_0, strlen((const char*)message1_0));

            	/* Convert data to ASCII. Leave the last character 0, because
            	 * it is the null terminator.
            	 */
            	for(int i = 0; i < 8; i++){
            		/* Take the most significant 4 bits. The value of
            		 * those 4 bits is the offset of the ASCII lookup table.
            		 */
            		uint8_t offset = (data & 0xF0000000) >> 28; //offset has the value of the most significant 4 bits then shifted to LSB
            		data_ASCII[i] = Hex_to_ASCII[offset];

            		/* Shift the next hex digit (4 bits) to the MSB */
            		data = data << 4;
            	}

            	/* Once all 8 hex characters stored in data_ASCII, print it. */
            	TransmitData((const char*)data_ASCII, strlen((const char*)data_ASCII));

            	uint8_t message1_1[] = {"\n\r"};
            	TransmitData((const char*)message1_1, strlen((const char*)message1_1));

                // invalidate the entry
                MEMU.FLASH_UNCERR_STS.R = 0x80000000;

                // remove the reson of ECC error (application specific)
                Fix_2bit_error_FLASH_data();
            }
        }

