MarcoHG/MPC5744P_examples/FLASH_ECC_Error_Injection_MPC5744P/src/main.c
        if (MEMU_ERR_FLAG_value & MEMU_ERR_FLAG_F_CE)
        {
            for(i=0;i<20;i++)
            {
                if (1 == MEMU.FLASH_CERR[i].STS.B.VLD)
                {
                	uint32_t data = MEMU.FLASH_CERR[i].ADDR.R;
                	uint8_t data_ASCII[9] = {0}; //Last character is null terminator

                    /* printf("It is correctable error at address "); */
                	uint8_t message0[] = {"It is correctable error at address "};
                	TransmitData((const char*)message0, strlen((const char*)message0));

                    /* printf("0x%08X\r\n",MEMU.FLASH_CERR[i].ADDR.R); */
                	uint8_t message1_0[] = {"0x"};
                	TransmitData((const char*)message1_0, strlen((const char*)message1_0));


                	/* Convert data to ASCII. Leave the last character 0, because
                	 * it is the null terminator.
                	 */
                	for(int i = 0; i < 8; i++){
                		/* Take the most significant 4 bits. The value of
                		 * those 4 bits is the offset of the ASCII lookup table.
                		 */
                		uint8_t offset = (data & 0xF0000000) >> 28; //offset has the value of the most significant 4 bits then shifted to LSB
                		data_ASCII[i] = Hex_to_ASCII[offset];

                		/* Shift the next hex digit (4 bits) to the MSB */
                		data = data << 4;
                	}

                	/* Once all 8 hex characters stored in data_ASCII, print it. */
                	TransmitData((const char*)data_ASCII, strlen((const char*)data_ASCII));

                	uint8_t message1_1[] = {"\n\r"};
                	TransmitData((const char*)message1_1, strlen((const char*)message1_1));

                    // invalidate the entry
                    MEMU.FLASH_CERR[i].STS.R = 0x80000000;

                    /* there is no need to correct single bit errors */
                    /* printf("Single bit errors ignored\r\n"); */
                    uint8_t message2[] = {"Single bit errors ignored\r\n"};
                    TransmitData((const char*)message2, strlen((const char*)message2));

                }
            }

        }

        if (MEMU_ERR_FLAG_value & MEMU_ERR_FLAG_FLASH_overflows)
        {
            /* printf("Overflow!"); */
        	uint8_t message0[] = {"Overflow!"};
        	TransmitData((const char*)message0, strlen((const char*)message0));
            while(1)
            {
                //asm("nop");
            	//__asm__("nop");
            	__asm__("e_ori 0,0,0");
            }
        }

    }

    /* check other possible sources */
    else if (MEMU_ERR_FLAG_value & MEMU_ERR_FLAG_PERRAM_all)
    {
        /* printf("Peripheral RAM ECC error found\r\n"); */
    	uint8_t message0[] = {"Peripheral RAM ECC error found\r\n"};
    	TransmitData((const char*)message0, strlen((const char*)message0));
    }

    else if (MEMU_ERR_FLAG_value & MEMU_ERR_FLAG_SYSRAM_all)
    {
        /* printf("System RAM ECC error found\r\n"); */
    	uint8_t message0[] = {"System RAM ECC error found\r\n"};
    	TransmitData((const char*)message0, strlen((const char*)message0));
    }

    /* clear all MEMU error flag flags to stop FCCU fault indication */
    MEMU.ERR_FLAG.R = 0xFFFFFFFF;
}


/*******************************************************************************
Function Name : Machine_check_handler
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         : Function handles Machine_check_handler
*******************************************************************************/
//__interrupt
void Machine_check_handler(void)
{

    MEMU_handler();

    Increment_MCSRR0_to_next_instruction();

    ClearMCSR();

    IVOR1_handler_pass_count++;

}


/*******************************************************************************
Function Name : Generate_noncorrectable_FLASH_ECC_error
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
Issues        :
*******************************************************************************/
void Generate_noncorrectable_FLASH_ECC_error(void)
{
    register uint32_t test_read = 0;

    /**********   Flash partitioning on MPC5744P               **********/
    // 4x 16 KB in partition 0/1 (2x blocks EEPROM emulation enabled)
    // 2x 32 KB in partition 2/3 (EEPROM emulation enabled)
    // 6x 64 KB in partition 4/5
    // 8x 256 KB in partition 6/7

    /**********   Flash blocks on MPC5744P                     **********/
    // Data flash memory - no overlay
    // 0x00800000 - 0x00803FFF 16 16KB EEPROM low block 0
    // 0x00804000 - 0x00807FFF 16 16KB EEPROM low block 1
    // 0x00808000 - 0x0080FFFF 32 32KB EEPROM mid block 0
    // 0x00810000 - 0x00817FFF 32 32KB EEPROM mid block 1

    // Small flash memory blocks - no overlay
    // 0x00F98000 - 0x00F9BFFF 16 16KB low flash memory block 2 (boot 0)
    // 0x00F9C000 - 0x00F9FFFF 16 16KB low flash memory block 3 (boot 1)

    // Medium flash memory blocks - no overlay
    // 0x00FA0000 - 0x00FAFFFF 64 64KB high flash memory block 0 (boot 2)
    // 0x00FB0000 - 0x00FBFFFF 64 64KB high flash memory block 1 (boot 3)
    // 0x00FC0000 - 0x00FCFFFF 64 64KB high flash memory block 2
    // 0x00FD0000 - 0x00FDFFFF 64 64KB high flash memory block 3
    // 0x00FE0000 - 0x00FEFFFF 64 64KB high flash memory block 4
    // 0x00FF0000 - 0x00FFFFFF 64 64KB high flash memory block 5

    // Large flash memory blocks - no overlay
    // 0x01000000 - 0x0103FFFF 256 256KB flash memory block 0 (boot 4)
    // 0x01040000 - 0x0107FFFF 256 256KB flash memory block 1 (boot 5)
    // 0x01080000 - 0x010BFFFF 256 256KB flash memory block 2 (boot 6)
    // 0x010C0000 - 0x010FFFFF 256 256KB flash memory block 3 (boot 7)
    // 0x01100000 - 0x0113FFFF 256 256KB flash memory block 4
    // 0x01140000 - 0x0117FFFF 256 256KB flash memory block 5
    // 0x01180000 - 0x011BFFFF 256 256KB flash memory block 6
    // 0x011C0000 - 0x011FFFFF 256 256KB flash memory block 7


    /* Generate flash ECC error */

    // step1. unlock all blocks (for simplicity)
    C55FMC.LOCK0.R = 0;
    C55FMC.LOCK1.R = 0;
    C55FMC.LOCK2.R = 0;
    C55FMC.LOCK3.R = 0;

    // step2. erase the large block 7 (0x011C0000 - 0x011FFFFF)
    C55FMC.MCR.B.ERS = 1;
    C55FMC.SEL2.R = 0x00000080; // select the large block 7
    *(unsigned int*)0x011C0000 = 0xFFFFFFFF;    //interlock write
    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.ERS = 0;

