MarcoHG/MPC5744P_examples/FLASH_ECC_Error_Injection_MPC5744P/src/main.c
    // step3. program data
    C55FMC.MCR.B.PGM = 1;
    *(unsigned int*)0x011C0000 = 0x00450000;    //interlock write
    *(unsigned int*)0x011C0004 = 0x00000000;

    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.PGM = 0;

    // step4. over-program data - this generates ECC error
    C55FMC.MCR.B.PGM = 1;
    *(unsigned int*)0x011C0000 = 0x00580000;    //interlock write
    *(unsigned int*)0x011C0004 = 0x00000000;
    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.PGM = 0;

    // step 5. now here the ECC is checked and non-correctable error found
    test_read = *(unsigned int*)0x011C0000;
    //test_read = *(unsigned int*)0x011C0004;

    /* Without this line, the compiler will optimize out the dummy read. */
    if(test_read){
    	return;
    }

}


/*******************************************************************************
Function Name : Generate_1bit_FLASH_ECC_error
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
Issues        :
*******************************************************************************/
void Generate_1bit_FLASH_ECC_error(void)
{
    register uint32_t test_read = 0;

    /* Enable single bit ECC error reporting in flash controller */

    // Enable UTest mode
    C55FMC.UT0.R = 0xF9F99999;
    // Enable single bit error correction
    C55FMC.UT0.B.SBCE = 1;
    // Finish the UTest mode by writing UT0[UTE] with 0.
    C55FMC.UT0.B.UTE = 0;

    /* Now generate flash ECC error */

    // step1. unlock all blocks (for simplicity)
    C55FMC.LOCK0.R = 0;
    C55FMC.LOCK1.R = 0;
    C55FMC.LOCK2.R = 0;
    C55FMC.LOCK3.R = 0;

    // step2. erase the large block 7 (0x011C0000 - 0x011FFFFF)
    C55FMC.MCR.B.ERS = 1;
    C55FMC.SEL2.R = 0x00000080; // select the large block 7
    *(unsigned int*)0x011C0000 = 0xFFFFFFFF;    //interlock write
    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.ERS = 0;

    // step3. program data
    C55FMC.MCR.B.PGM = 1;
    *(unsigned int*)0x011C0000 = 0xFFFFFFFF;    //interlock write
    *(unsigned int*)0x011C0004 = 0x00000000;

    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.PGM = 0;

    // step4. over-program data - this generates ECC error
    C55FMC.MCR.B.PGM = 1;
    *(unsigned int*)0x011C0000 = 0xFFFFFFFF;    //interlock write
    *(unsigned int*)0x011C0004 = 0x00000001;
    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.PGM = 0;

    // step 5. now here the ECC is checked and non-correctable error found
    test_read = *(unsigned int*)0x011C0000;
    //test_read = *(unsigned int*)0x011C0004;

    /* Without this line, the compiler will optimize out the dummy read. */
    if(test_read){
    	return;
    }

}


/*******************************************************************************
Function Name : Fix_2bit_error_FLASH_data
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
*******************************************************************************/
void Fix_2bit_error_FLASH_data(void)
{
    // erase block as example of data correction (application specific)
    Erase_L7_block();
}


/*******************************************************************************
Function Name : Erase_L7_block
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
*******************************************************************************/
void Erase_L7_block(void)
{
    // step1. unlock all blocks (for simplicity)
    C55FMC.LOCK0.R = 0;
    C55FMC.LOCK1.R = 0;
    C55FMC.LOCK2.R = 0;
    C55FMC.LOCK3.R = 0;

    // step2. erase the large block 7 (0x011C0000 - 0x011FFFFF)
    C55FMC.MCR.B.ERS = 1;
    C55FMC.SEL2.R = 0x00000080; // select the large block 7
    *(unsigned int*)0x011C0000 = 0xFFFFFFFF;    //interlock write
    C55FMC.MCR.B.EHV = 1;
    while(C55FMC.MCR.B.DONE == 0);
    C55FMC.MCR.B.EHV = 0;
    C55FMC.MCR.B.ERS = 0;

    /* printf("L7 flash block erased (0x011C0000 - 0x011FFFFF) \r\n"); */
    uint8_t message0[] = {"L7 flash block erased (0x011C0000 - 0x011FFFFF) \r\n"};
    TransmitData((const char*)message0, strlen((const char*)message0));
}

/*******************************************************************************
* Global functions
*******************************************************************************/

/*******************************************************************************
Function Name : main
Engineer      : David Tosenovjan
Date          : Mar-05-2016
Parameters    :
Modifies      :
Returns       :
Notes         :
*******************************************************************************/
int main (void)
{
	uint8_t ch=0;

    Sys_Init();

    LINFlexD_1_Init();

    /* printf("ECC error injection example\r\n"); */
    uint8_t message0[] = {"ECC error injection example\r\n"};
    TransmitData((const char*)message0, strlen((const char*)message0));

    xcptn_xmpl();

    /* Set interrupt priority for FCCU (PSR 488). */
    INTC_0.PSR[488].R = 0x801F;

    FCCU_Init();



    SetMSR_ME();

    /* Generate error. Wait for user input */

    uint8_t message_loop0[] = {"\n\rPress '1' to generate noncorrectable error or '2' to generate 1-bit error.\n\r"};
    uint8_t message_loop1[] = {"\n\rInvalid input! Reset system and try again.\n\r"};
    uint8_t end_message[] = {"\n\rEnd of MPC5744P ECC error test.\n\r"};
    TransmitData((const char*)message_loop0,strlen((const char*)message_loop0));
    ReceiveData((char*)&ch);
    /**************************************************************************/
    /*                                                                        */
    /* Choose which ECC error is supposed to be injected !					  */
    /* Enter '1' for noncorrectable error									  */
    /* Enter '2' for 1-bit error 											  */
    /*                                                                        */
    /**************************************************************************/
    switch(ch){
    case '1':
    	Generate_noncorrectable_FLASH_ECC_error();
    	break;
    case '2':
    	Generate_1bit_FLASH_ECC_error();
    	break;
    default:
    	TransmitData((const char*)message_loop1,strlen((const char*)message_loop1));
    	break;
    }

    TransmitData((const char*)end_message,strlen((const char*)end_message));

    while(1);

  return 0;
}//main
